In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
x=pd.read_excel(r"C:\Users\user\Downloads\Reconciliation_Report.xlsx")

In [4]:
x

   Invoice No        Date  Amount_Sales  Amount_GL  Mismatch_Reason
0         103  2024-11-03        3000.0     3500.0  Amount Mismatch
1         104  2024-11-04        6000.0        NaN  Amount Mismatch
2         105  2024-11-04           NaN     6000.0  Amount Mismatch

In [5]:
x['product']=''

In [6]:
x

   Invoice No        Date  Amount_Sales  Amount_GL  Mismatch_Reason product
0         103  2024-11-03        3000.0     3500.0  Amount Mismatch
1         104  2024-11-04        6000.0        NaN  Amount Mismatch
2         105  2024-11-04           NaN     6000.0  Amount Mismatch

In [7]:
x['product']=x['Amount_Sales']

In [8]:
x

   Invoice No        Date  Amount_Sales  Amount_GL  Mismatch_Reason  product
0         103  2024-11-03        3000.0     3500.0  Amount Mismatch   3000.0
1         104  2024-11-04        6000.0        NaN  Amount Mismatch   6000.0
2         105  2024-11-04           NaN     6000.0  Amount Mismatch      NaN

In [9]:
del x['Invoice No'] #function to delete the column

In [10]:
x

         Date  Amount_Sales  Amount_GL  Mismatch_Reason  product
0  2024-11-03        3000.0     3500.0  Amount Mismatch   3000.0
1  2024-11-04        6000.0        NaN  Amount Mismatch   6000.0
2  2024-11-04           NaN     6000.0  Amount Mismatch      NaN

In [11]:
x.shape

(3, 5)

In [12]:
x.columns

Index(['Date', 'Amount_Sales', 'Amount_GL', 'Mismatch_Reason', 'product'], dtype='object')

In [13]:
x['product'].fillna(0)

0    3000.0
1    6000.0
2       0.0
Name: product, dtype: float64

In [14]:
x

         Date  Amount_Sales  Amount_GL  Mismatch_Reason  product
0  2024-11-03        3000.0     3500.0  Amount Mismatch   3000.0
1  2024-11-04        6000.0        NaN  Amount Mismatch   6000.0
2  2024-11-04           NaN     6000.0  Amount Mismatch      NaN

In [15]:
x['product']=x['product'].fillna(0)

In [16]:
x

         Date  Amount_Sales  Amount_GL  Mismatch_Reason  product
0  2024-11-03        3000.0     3500.0  Amount Mismatch   3000.0
1  2024-11-04        6000.0        NaN  Amount Mismatch   6000.0
2  2024-11-04           NaN     6000.0  Amount Mismatch      0.0

In [17]:
x[['Amount_Sales', 'Amount_GL']] = x[['Amount_Sales','Amount_GL']].fillna(0)

In [18]:
x

         Date  Amount_Sales  Amount_GL  Mismatch_Reason  product
0  2024-11-03        3000.0     3500.0  Amount Mismatch   3000.0
1  2024-11-04        6000.0        0.0  Amount Mismatch   6000.0
2  2024-11-04           0.0     6000.0  Amount Mismatch      0.0